"""
给定一个 n × n 的二维矩阵表示一个图像。将图像顺时针旋转 90 度。
说明：
你必须在原地旋转图像，这意味着你需要直接修改输入的二维矩阵。请不要使用另一个矩阵来旋转图像。
示例 1:
给定 matrix =
[  [1,2,3],
  [4,5,6],
  [7,8,9]],
原地旋转输入矩阵，使其变为:
[  [7,4,1],
  [8,5,2],
  [9,6,3]]
"""
a = [
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ]
# a1 = list(zip(*a))
# print(a1)
# a2 = map(lambda x: list(x)[::-1], a1)
# print(a2)
# b = [1, 2, 3]
# b.reverse()
# print(b)
# 先解包，再对每一个元素翻转
a[:] = list(map(lambda x: list(x)[::-1], zip(*a)))
# 先翻转
a[::] = a[::-1]
n = len(a)
# 再对角线上交换
for i in range(n):
    for j in range(i+1, n):
        a[i][j], a[j][i] = a[j][i], a[i][j]
